{"title":"编译实验总结感想","date":"2021-11-16T08:29:01.000Z","date_formatted":{"ll":"2021年11月16日","L":"2021/11/16","MM-DD":"11-16"},"thumbnail":"https://tva1.sinaimg.cn/large/008i3skNly1gwuyxmimj1j30tg0c0wfl.jpg","link":"posts/35016","tags":["感想","编译"],"updated":"2021-12-01T09:00:35.486Z","content":"<p>相关文章：[[Alxa_Compile编译器文档]]</p>\n<h2 id=\"总结感想\">总结感想<a title=\"#总结感想\" href=\"#总结感想\"></a></h2>\n<p>先说说关于选择PCODE，选择了PCODE，早早结束了编译实验的全部任务，也没经过很多人在选择mips85+还是选择PCODE+85的痛苦，私以为我不愿陷入焦虑去纠结这个什么给分高低，也不想浪费大量时间去研究怎么生成mips和卷优化，因为这不是我想做和喜欢的事情。也不为别的，就是想要轻松一点，节省时间做点自己想做的事情。当然，生成PCODE反而是我感觉更能让我觉得有趣的事情，无需遵循某种既定的体系（虽然这可能对我没有好处），而是自己设计了PCODE指令，一边从递归下降中生成指令，一边写虚拟机解释器，在这之间，我不断修改指令生成和解释器，感觉自己能够完全地掌控这个我亲手写的编译器，最后让虚拟机完整地成功地跑代码，反而对我来说是一件很有成就感的事情。</p>\n<p>至于[[设计文档]]为什么要写成英文，首先，想要更方便更直观地描述代码，类，对象，与其给每一个东西一个汉语解释，我认为干脆用英文来描述更显自然，第二，想在写文档的同时顺便练练英语，仅此而已。不是想给助教和看我文档的人添麻烦，如果很不方便阅读，可以翻译成汉语再读，亲测用有道翻译完还是可以看懂的，实在不行也可以来垂询我本人。总结当然就不写英语了，毕竟不是母语。</p>\n<p>关于一些反思，在语法分析和代码生成两部分，我还是没有设计好架构就开始写，完工后出现了较多bug，甚至在代码生成de到了语法分析时候的bug，在面向对象课程的时候，已经多次反思过这件事，这实属不该，在今后的大型工程中，要继续好好注意架构设计。也非常感谢在我debug过程中帮到我的zyq，lyx，dky同学。</p>\n<p>最后，站在我个人的角度，我认为从词法分析，语法分析，错误处理，到代码生成这四个任务，已经很好的做到了让我对一个编译器体系架构充分理解并让我把它完整的做出来，对我个人而言，这已经完整了，我算是轻松愉快地（除了在语法分析和代码生成两次任务debug的时候属实不太顺利）完成了编译实验，很有成就感，且收获颇丰。</p>\n<h2 id=\"意见建议\">意见建议<a title=\"#意见建议\" href=\"#意见建议\"></a></h2>\n<p>首先，个人认为课程实验的安排很好，虽然在初期阶段不是很清楚后面要做什么，但是课程组的词法分析和语法分析的作业要求很好的贯彻了一点，尽管我没有设计好后边怎么进行代码生成，因为词法分析中对每个Token的正确生成，语法分析中正确的递归下降，也可以很好地设计出正确的编译前端，错误处理同样很有帮助，在设计错误处理的时候进行了符号表的设计，以及在debug的过程中更清晰的认知了数组传参的过程，以至于在代码生成阶段不会出现过多需要考虑的问题，四次实验，基本没有出现完全不知道怎么做的情况，也没有出现某一次实验过于困难或简单的情况，总体体验还是很好的。</p>\n<p>官方提供的辅助测试库也非常友好，同学们做的测试集非常好，通过学号还可以询问其本人，让debug变得轻松了不少。错误处理实验，虽然没有官方提供的测试数据，在讨论区也有同学热心提供了样例。</p>\n<p>该学年我们有幸第一次可以使用Java，我本人也是使用了Java写这个编译器，个人认为同学们更熟悉Java语言，可以更好的把注意力放在编译器的架构设计上，C++会让这个过程提高难度。</p>\n<p>这门课程的实验很完善，确实提不出大方向的建议，细节上有以下几点：</p>\n<ul>\n<li>Judge平台登陆页面的表单存在一些问题，不能直接触发浏览器的密码填充，需要点三次或者先输入几个字符再删掉</li>\n<li>期中考试时评测机体验实在太差了，在等待评测上耗费了大量时间</li>\n<li>不理解设计文档为什么只能是压缩包，不能交pdf</li>\n</ul>\n<p>感谢编译实验课程组的辛勤教学！</p>\n","prev":{"title":"Unknown collation- 'utf8mb4_0900_ai_ci'","link":"posts/12888"},"next":{"title":"Alxa_Compiler 编译器","link":"posts/51052"},"plink":"http://atksoto.com/posts/35016/","toc":[{"id":"总结感想","title":"总结感想","index":"1"},{"id":"意见建议","title":"意见建议","index":"2"}],"reading_time":"1248 字约 8 分钟"}